{
  "telangana": [
    {
      "name": "Rajiv Gandhi Institute of Medical Sciences (RIMS), Adilabad (Telangana)",
      "details": " NEET UG (Telangana Government Medical Colleges – Open Category): Opening rank: ~12,883 Closing rank: ~19,924 Previous year Telangana NEET trends: For General category, closing rank across Government colleges hovered around 11,000 for MBBS"
    },
    {
      "name": "Kakatiya University, Warangal (Telangana)",
      "details": " Primarily used for admissions to postgraduate programs via TS ICET/TS ICET and TS LAWCET: MCA (TS ICET 2024): General category closing rank: ~37,836 MBA (TS ICET 2024): General closing rank: ~18,836 LAW (TS LAWCET 2025): BA LLB closing rank: ~1,773 (General) LLB closing rank: ~3,065 (General)"
    },
    {
      "name": "Jawaharlal Nehru Technological University (JNTU) – Andhra Pradesh / Telangana",
      "details": " Admissions are based on EAMCET/EAPCET or NEET (for medical programs). Here's a snapshot: JNTU Hyderabad (Engineering, TS EAMCET 2025 – General category): CSE: ~1,270 ECE: ~4,711 Cybersecurity: ~5,075 AI & ML: ~5,512 EEE: ~9,386 Mechanical: ~11,153 Civil: ~16,444 JNTU Anantapur (JNTUA – A.P., EAPCET 2024): General closing ranks ranged widely (CSE up to ~124,802; ECE up to ~8,002)"
    },
    {
      "name": "ABV Government Degree College (Warangal)",
      "details": " Example for B.Sc. Statistics: Cut-off marks around 46.5% Typically, degree colleges under DOST follow 10+2 merit-based admissions, with cut-off marks in the 40–55% range depending on demand and course."
    },
    {
      "name": "University Arts & Science",
      "details": " No specific cut-off data available. Admissions typically revolve around 10+2 merit, with general category cut-offs often falling between 40–60%, influenced by course popularity and seat availability."
    }
  ],
  "maharashtra": [
    {
      "name": "VNIT Nagpur (Visvesvaraya National Institute of Technology)",
      "details": " JEE Main Cut-off (General, CSE): Expected All-India ranks roughly between 5,000–7,000, with percentiles around 99.35–99.4 for Other State applicants; Home State applicants may require ~99.15–99.2 percentile. Eligibility: Candidates must have passed Class XII with at least 75% (65% for SC/ST/PwD) or be in the top 20 percentile of their board exams."
    },
    {
      "name": "BJTI Mumbai (Veermata Jijabai Technological Institute)",
      "details": " MHT-CET Cut-offs (2023 data): Computer Engineering: Last-round percentile ~99.89 (GOPEN), or CET rank around 208. Eligibility: Admission through MHT-CET, highly competitive for top branches."
    },
    {
      "name": "Seth G.S. Medical College (KEM), Mumbai",
      "details": " NEET UG (Round 1, All-India Quota): General: Closing rank ~868 OBC: ~3,140 State quota: General around 1,361. Expected NEET Scores (AIQ): General category marks anticipated between 670–690; OBC between 650–670, SC between 580–610."
    },
    {
      "name": "Narsee Monjee College of Commerce & Economics (NMCCE), Mumbai",
      "details": " CUET + Class XII Merit: General category (B.Com): Cutting scores around 91.8%–94.3%. BAF (Open): ~94.4%–97.8% BFM: ~93.3%–95.8%. Other Projections: B.Com (General): 80%–90% BAF (General): 85%–90%. Eligibility: CUET scores accepted and combined with Class XII marks; at least 45% in 12th to apply for BMS/B.Com courses."
    },
    {
      "name": "Dr. Ambedkar College (Nagpur)",
      "details": " Admissions (FYJC/Class 11) via centralized process. First merit-list cut-offs: Science stream: ~93.2% Commerce stream: ~90.6%. Note: These pertain to junior college (11th) admissions, not degree courses."
    },
    {
      "name": "Sydenham College of Commerce & Economics (Mumbai)",
      "details": " UG Merit-Based Cut-Offs (AI-Open Category): Highest: ~94.8% Lowest (First-round): ~81.15% . Additional Admission Criteria: Typically requires 10+2 with 45% marks (General) or 40% (SC/ST). Admission based on HBSU-CET or equivalent entrance test plus class XII marks."
    }
  ],
  "karnataka": [
    {
      "name": "Kasturba Medical College (Manipal)",
      "details": " NEET UG MBBS Cut-off (General, All-India Quota): Expected score range: 670–690 marks (General), with reserved category expected cut-offs lower (SC/ST/OBC: 535–590 marks). Alternate estimates suggest a slightly lower range of 580–650 for safer admission chances. Eligibility: NEET UG rank required (250 MBBS seats offered annually). General cutoff percentile typically around 50th, OBC/SC/ST around 40th percentile."
    },
    {
      "name": "St. John’s Medical College (Bengaluru)",
      "details": " Accepted answer: Specific cut-off data not found in provided results. Typically depends on NEET UG rank, with high competition and both central/institutional quotas—rank expectations often in top few dozens to hundreds nationally. Let me know if you'd like me to dig deeper."
    },
    {
      "name": "Sree Veerendra Patil Medical College, Shivamogga (Siddaganga Institute)",
      "details": " No exact cut-off data identified in search results. Admissions via NEET UG through Karnataka state counselling (KEA). Likely requires a competitive NEET score within Karnataka's middle-to-upper percentile. I can attempt deeper search if needed."
    },
    {
      "name": "Government Arts College",
      "details": " India (General/Regional Context): Arts colleges typically admit based on 10+2 merit from the state board. Minimum cut-off often ranges between 40–60% overall, depending on demand and seat availability. For some specialized courses (honours), thresholds could be higher (~65–75%). Specific cut-offs vary widely by city/college; detailed data is usually published on college websites or admission portals."
    },
    {
      "name": "University College of Arts (Tumkur)",
      "details": " Similar to above: based on Karnataka PUC or equivalent marks. Merit-based admission, exact cut-offs dependent on program and competition; likely requiring 40–60% (General category) in prior exam. Detailed program-wise cut-offs usually released at admission time."
    },
    {
      "name": "VTU Belgaum (Visvesvaraya Technological University—Engineering)",
      "details": " KCET Cut-off (General Category): Computer Science & Engineering (CSE): closing ranks for 2025 vary across sources: Historically between 20,000–33,000. Expected range for 2025: 37,300–37,800. Earlier projections estimate 4,000–10,000 for highly competitive branches like CSE. Overall general closing ranks for B.Tech courses range approximately 36,600–48,500. Eligibility: KCET or COMEDK/JEE Main scores required, along with ≥ 50% in 10+2 (45% for reserved categories)."
    },
    {
      "name": "Bheemanna Khandre Institute of Technology (B.K. Institute, Bhalki, Karnataka)",
      "details": " Specific cutoff data not retrieved. Likely admissions via KCET/COMEDK/JEE Main with broader rank range, often lower competition than VTU’s central colleges. Expect general KCET rank estimates between 40,000–100,000+, depending on branch and category. Exact numbers typically published on KEA portal or institute admission notice."
    }
  ],
  "delhi": [
    {
      "name": "Jamia Millia Islamia (JMI)",
      "details": " CUET Cut-offs (UG courses): BA (Hons) Economics: ~60–72 percentile BA (Hons) Arabic: ~80–91 percentile BA (Hons) Psychology: ~62–74 percentile B.Tech (via JEE Main): Closing ranks in 2025 ranged from approximately 15,766 (most competitive, perhaps Computer Engineering) to 73,279 (less competitive disciplines) Eligibility: Reservation: 5% of B.Tech seats are for Persons with Disabilities (No explicit board marks threshold found in current sources.)"
    },
    {
      "name": "Delhi Technological University (DTU)",
      "details": " JEE Main (via JAC Delhi) Cut-offs: Last closing ranks (General, AI quota) ranged between 6,200 and 19,949 depending on the branch Board Eligibility (Class XII): Minimum 60% aggregate in PCM (General category) 55% for OBC-NCL & Defence 50% for SC/ST/PwD"
    },
    {
      "name": "Maulana Azad Medical College (MAMC)",
      "details": " NEET Cut-offs for MBBS (all-India / DU quotas): Expected scores (NEET 2025): General: 705–730 EWS: 700–715 Reserved (SC/ST/OBC): 668–710 Previous data suggests competitive closing ranks around 85 for General category Eligibility Criteria: Must have passed Class XII with minimum 50% aggregate in Physics, Chemistry & Biology Minimum age: 17 years by December 31 of the admission year Seat distribution: 15% All India Quota (AIQ), 85% Delhi state quota (DUQ)"
    },
    {
      "name": "Shri Ram College of Commerce (SRCC)",
      "details": " CUET Cut-offs (UG): B.Com (Hons): General category score needed: 917/800 (seems unusually beyond typical scale—possibly a scaled score) Expected percentile: 97.3%–99.5% for General category B.A. (Hons) Economics: Expected cutoff percentile: 98.5%–99% Eligibility (12th board): B.A. Economics: Minimum 45% + Mathematics mandatory B.Com (Hons): Minimum 45% + Mathematics/Business Mathematics in 12th"
    },
    {
      "name": "Hindu College",
      "details": " CUET Cut-offs (UG): Round 1 (General): B.A. admissions ranging from 480.32 to 950.58—the higher end (e.g., Political Science) extremely competitive Highest cutoff noted: 950/1000 for B.A. (Hons) Political Science CUET cutoff percentile: Minimum 97 percentile for admission to DU Hindu College Honours courses Additional Context: Hindu College had the highest CUET cutoff among DU colleges in Round 1 of admissions 2025 Eligibility (12th board): B.A. (Hons): 45% aggregate B.Sc. (Hons): 55% in science stream in core subjects"
    },
    {
      "name": "Indraprastha College for Women (IP College)",
      "details": " CUET Cut-offs (UG): Expected CUET percentiles (2024 estimates): B.Com (Hons): ~98.25 percentile (General) SC: ~90, ST: ~87, EWS: ~97 Previous B.A. (Hons) cutoffs: Political Science ~734, History ~718, Psychology ~765, English ~702 (out of 800 scale) Eligibility: Minimum 45% aggregate in Class XII from a recognized board For some courses (B.Sc./B.Com), Mathematics may be compulsory"
    }
  ],
  "west-bengal": [
    {
      "name": "Jadavpur University (JU), Kolkata",
      "details": " Cut-offs (UG Engineering/B.Tech via WBJEE): For the General All-India (AI) quota, closing ranks in 2024 ranged from approximately 57 to 2,917, depending on the discipline. Eligibility: Admission is based on WBJEE rank (and sometimes JEE Main or university-specific tests). For engineering, 90% of General category seats go to West Bengal domicile candidates, with 10% for AI quota. The OBC reservation policy has been fluctuating due to legal developments: As of mid-2025, no OBC admissions occurred due to pending court rulings. Later the intake portal opened with a 7% OBC reservation, complying with HC directives while awaiting further clarity Recently, JU announced increasing OBC seats to 17%, with 10% to be filled from the waiting list—pending legal finalization."
    },
    {
      "name": "Nil Ratan Sircar Medical College (NRS), Kolkata",
      "details": " NEET UG (MBBS) Cut-off – All India Quota (Round 1, 2025): General category closing rank: ~5,524. OBC category (AI quota): ~7,671. Expected NEET Score (General): ~580–590. State Quota (WB): Historically, closing ranks have been significantly higher (i.e., lower rank numbers), such as ~11,275 for General in previous years."
    },
    {
      "name": "Calcutta National Medical College (CNMC), Kolkata",
      "details": " NEET UG (MBBS) Cut-off – All India Quota (Round 1, 2025): General category closing rank: ~6,375. OBC category: ~8,258. Expected general NEET rank range: ~12,000–16,000. Historical data (2024): closing ranks around 5,975."
    },
    {
      "name": "Vivekananda Satavarshiki Mahavidyalaya (VSM), Jhargram",
      "details": " Cut-off / Eligibility: Admission to B.A., B.Sc., B.Com is merit-based on 10+2 marks. Typically requires 45–50% overall, with at least 50% in the concerned subject for honours courses."
    },
    {
      "name": "Scottish Church College, Kolkata",
      "details": " UG (General category) cut-offs: CUET percentile for B.Com (Accounting & Finance): around 80–85 percentile. Overall admission cut-offs typically fall in the 75–85% range; reserved categories require around 50%. Reddit discussions align: “For Scottish 80+ will be safe…”. Additional Data (CU exam scores): Admissions scoring references: e.g., B.A. (Hons.) Sanskrit ~271, Philosophy ~221 (General-All India) ."
    },
    {
      "name": "University of Kalyani",
      "details": " B.Tech (WBJEE) Cut-offs (General category): Expected cutoff range for Computer Science & Engineering: rank 3,000–7,000. In 2024, general AI category cutoff ranks ranged between 3,351 and 6,975. Detailed category-wise: General AI ~7,118, HS quota up to 27,180; OBC-B HS ~9,564. Eligibility (other courses): General candidates must score at least 45% in qualifying exam. For admission to some PG programs, candidates need a relevant UG degree (e.g., B.Sc. Honours in science or BA in Arts fields)."
    }
  ]
}